---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AnalyticalLinkReleaseRotationZ
source: html/b60cbcff-2d0b-5830-63d5-be04f403a351.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AnalyticalLinkReleaseRotationZ Property

"Z Rotation"

## Syntax (C#)
```csharp
public static ForgeTypeId AnalyticalLinkReleaseRotationZ { get; }
```